# Даны целые положительные числа a и b (a>b)
# На отрезке длины a размещено максимальное количество отрезков длины b
# Используя операцию взятия остатка от деления на цело, найти длину не занятой части большого отрезка

a = input("Введите длину большого отрезка: ")
b = input("Введите длину малого отрезка: ")
while type(a) != int:
    try:
        a=int(a)
    except ValueError:
        print("ОШИБКА: Длина большого отрезка введена некоректно!")
        a = input("Введите целое число: ")
while type(b) != int:
    try:
        b=int(b)
    except ValueError:
        print("ОШИБКА: Длина малого отрезка введена некоректно!")
        b = input("Введите целое число: ")

if a>b:
    result = a%b
    print("Длина остатка большого отрезка: ",result)